# <center>[Pandas DataFrame: Exercises, Practice, Solution](https://www.w3resource.com/python-exercises/pandas/index-dataframe.php)</center>

### 1. Write a Pandas program to get the powers of an array values element-wise.

Note: First array elements raised to powers from second array. <br> <br>
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} <br> <br>
Expected Output: <br>
X Y Z <br>
0 78 84 86 <br>
1 85 94 97 <br>
2 96 89 96 <br>
3 80 83 72 <br>
4 86 86 83

N.B: Questions seems unclear to me. Though I checked sample solution and it matched with my below solution.

In [46]:
# Importing necessary libraries for all problems:

import numpy as np
import pandas as pd

In [47]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels. <br>
Sample Python dictionary data and list labels: <br> <br>
**exam_data** = *{'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], <br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']*

In [48]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index = labels)

print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

Sample Python dictionary data and list labels: <br> <br>
**exam_data** = *{'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], <br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']*

In [49]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index = labels)

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

### 4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [50]:
# Solution: 1

df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [51]:
# Solution: 2

df.iloc[:3, :]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 5. Write a Pandas program to select the 'name' and 'score' columns from the above (exam_data) DataFrame.

In [52]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

### 6. Write a Pandas program to select the specified columns and rows from a given data frame.

Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [53]:
# Solution 1:

df[['name', 'score']].iloc[[1, 3, 5, 6], :]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [54]:
# Solution 2:

df.iloc[[1, 3, 5, 6], [0, 1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

### 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [55]:
df[df['attempts'] > 2][['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0

### 8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [56]:
print('Number of rows of DataFrame:', df.shape[0])
print('Number of columns of DataFrame:', df.shape[1])

Number of rows of DataFrame: 10
Number of columns of DataFrame: 4

### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [57]:
print(df[df['score'].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [58]:
print(df[(df['score'] >= 15) & (df['score'] <= 20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 3 and score greater than 15.

In [59]:
print(df[(df['attempts'] < 3) & (df['score'] > 15)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

### 12. Write a Pandas program to change the score in row 'd' to 11.5.

In [60]:
# Solution 1: 

df['score'].loc['d'] = 11.5
df['score']

a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [61]:
# Solution 2:

df.loc['d', 'score'] = 11.5
df['score']

a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

### 13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [62]:
print('Sum of the examination attempts by the students:', df['attempts'].sum())

Sum of the examination attempts by the students: 19

### 14. Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [63]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print("\nMean score for each different student in data frame:", df['score'].mean())

Mean score for each different student in data frame: 13.5625

### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [64]:
df.loc['k'] = ['Suresh', 15.5, 'yes', 1]     # This line is similar to adding new data in SQL. 
print('Dataframe after adding new rows: ')
print(df)

print('\n')
# df = df.drop('k')      # We need to assign df = df.drop('k'), to perform inplace drop of row. Only df.drop('k') won't work.
df.drop('k', inplace = True)
print('Dataframe after removing the added rows:')
print(df)

Dataframe after adding new rows:
        name  score attempts qualify
a  Anastasia   12.5        1     yes
b       Dima    9.0        3      no
c  Katherine   16.5        2     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
j      Jonas   19.0        1     yes
k     Suresh   15.5      yes       1


Dataframe after removing the added rows:
        name  score attempts qualify
a  Anastasia   12.5        1     yes
b       Dima    9.0        3      no
c  Katherine   16.5        2     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
j      Jonas   19.0        1     yes

### 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [65]:
df.sort_values(by = ['name', 'score'], ascending = [False, True])

        name  score attempts qualify
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
c  Katherine   16.5        2     yes
j      Jonas   19.0        1     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
b       Dima    9.0        3      no
a  Anastasia   12.5        1     yes

### 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [66]:
df['qualify'] = df['qualify'].map({'yes': 'True', 'no': 'False'})
df

        name  score attempts qualify
a  Anastasia   12.5        1    True
b       Dima    9.0        3   False
c  Katherine   16.5        2    True
d      James    NaN        3   False
e      Emily    9.0        2   False
f    Michael   20.0        3    True
g    Matthew   14.5        1    True
h      Laura    NaN        1   False
i      Kevin    8.0        2   False
j      Jonas   19.0        1    True

### 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [67]:
df['name'].replace('James', 'Suresh', inplace = True)
df    # We can see the changed name in index row 'd'.

        name  score attempts qualify
a  Anastasia   12.5        1    True
b       Dima    9.0        3   False
c  Katherine   16.5        2    True
d     Suresh    NaN        3   False
e      Emily    9.0        2   False
f    Michael   20.0        3    True
g    Matthew   14.5        1    True
h      Laura    NaN        1   False
i      Kevin    8.0        2   False
j      Jonas   19.0        1    True

### 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [68]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

df.drop('attempts', axis = 1, inplace = True)
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

### 20. Write a Pandas program to insert a new column in existing DataFrame.

In [69]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data = exam_data, index = labels)

df['color'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
print('DataFrame after adding Color column:')
df

DataFrame after adding Color column:

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

### 21. Write a Pandas program to iterate over rows in a DataFrame.

In [70]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df = pd.DataFrame(data = exam_data)

for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

### 22. Write a Pandas program to get list from DataFrame column headers.

In [71]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, labels)
print(df.columns.values)

['name' 'score' 'attempts' 'qualify']

### 23. Write a Pandas program to rename columns of a given DataFrame.

In [72]:
data = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data)

df.rename(columns = {'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

### 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [73]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)

print(df[df['col1'] == 4])

   col1  col2  col3
1     4     5     8
3     4     7     0

### 25. Write a Pandas program to change the order of a DataFrame columns.

In [74]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)

print('Original DataFrame:\n')
print(df)

print('\nDataFrame afer altering columns:')
df = df[['col3', 'col2', 'col1']]
print(df)

Original DataFrame:

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

DataFrame afer altering columns:
   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

### 26. Write a Pandas program to add one row in an existing DataFrame.

In [91]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)

df2 = {'col1': 11, 'col2': 12, 'col3':13}
df = df.append(df2, ignore_index = True)
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    11    12    13

### 27. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [92]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)

df.to_csv('new_file.csv', sep = '\t', index = False)

new_df = pd.read_csv('new_file.csv')
print(new_df)

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1

### 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [98]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                   'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']
                  })

no_of_people_by_city = df.groupby(by = ['city']).count()
print(no_of_people_by_city)

             name
city
California      4
Georgia         2
Los Angeles     4

### 29. Write a Pandas program to delete DataFrame row(s) based on given column value.

In [106]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)

print(df[df['col2'] != 5])    #df['col2'] != 5 = False only for index=1. So it will show all other rows values.

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

### 30. Write a Pandas program to widen output display to see more columns.

In [118]:
data = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print(df)

# NO changes observed by changing options value. 
# Learned this by taking help from official solution.

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

### 31. Write a Pandas program to select a row of series/dataframe by given integer index.

In [132]:
print(df.iloc[[2]])    # sepcifying index 2 into [] make the result dataframe.

print('\n')

print(df.iloc[2])      # # sepcifying index 2 without [] make the result series.

   col1  col2  col3
2     3     6     9


col1    3
col2    6
col3    9
Name: 2, dtype: int64

### 32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [140]:
# Solution 1:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

print(df)   # Original Dataframe

print('\n')
print(df.replace(np.nan, 0.0) )  # After replacing NaN with 0.0

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes


        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [145]:
# Solution 2:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

print(df.fillna(0))

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

### 33. Write a Pandas program to convert index in a column of the given dataframe.

In [167]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)


print('\nSetting index as a column of dataframe:\n')
print(df.reset_index(level = 0))     
# level = 0, Only remove the first index levels from the index. Removes all levels by default. This parameter is useful for multilevel index.


print('\n\nHiding index from DataFrame: ')
print(df.to_string(index= False))

Setting index as a column of dataframe:

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes


Hiding index from DataFrame:
      name  score  attempts qualify
 Anastasia   12.5         1     yes
      Dima    9.0         3      no
 Katherine   16.5         2     yes
     James    NaN         3      no
     Emily    9.0         2      no
   Michael   20.0         3     yes
   Matthew   14.5         1     yes
     Laura    NaN         1      no
     Kevin    8.0         2      no
     Jonas   19.0         1     yes

### 34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [179]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

# df.set_value(index = 8, col = 'score', value = 10.2)  # set_value is deprecated and will be removed in a future release.

# Setting 10.2 for index = 8 and column = 'score':
df.at[8, 'score'] = 10.2

print('Dataframe after setting value for index = 8 and column = score:\n')
print(df)

# Note: 
# DataFrame.at : Access a single value for a row/column label pair.
# DataFrame.loc : Access a group of rows and columns by label(s).
# DataFrame.iloc : Access a group of rows and columns by integer position(s).

Dataframe after setting value for index = 8 and column = score:

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

### 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [209]:
# Number of null values on one or more columns:

df.isnull().values.sum()

2